HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPms_bf.h
/**
 * \file IfxPms_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Pms_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Pms_Registers
 * 
 */
#ifndef IFXPMS_BF_H
#define IFXPMS_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Pms_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODREV */
#define IFX_PMS_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODTYPE */
#define IFX_PMS_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_PMS_ID_Bits.MODNUMBER */
#define IFX_PMS_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVRC */
#define IFX_PMS_EVRSTAT_EVRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVRC */
#define IFX_PMS_EVRSTAT_EVRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVRC */
#define IFX_PMS_EVRSTAT_EVRC_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVC */
#define IFX_PMS_EVRSTAT_OVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVC */
#define IFX_PMS_EVRSTAT_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVC */
#define IFX_PMS_EVRSTAT_OVC_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVR33 */
#define IFX_PMS_EVRSTAT_EVR33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVR33 */
#define IFX_PMS_EVRSTAT_EVR33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVR33 */
#define IFX_PMS_EVRSTAT_EVR33_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OV33 */
#define IFX_PMS_EVRSTAT_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OV33 */
#define IFX_PMS_EVRSTAT_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OV33 */
#define IFX_PMS_EVRSTAT_OV33_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.OVSWD */
#define IFX_PMS_EVRSTAT_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.OVSWD */
#define IFX_PMS_EVRSTAT_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.OVSWD */
#define IFX_PMS_EVRSTAT_OVSWD_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVC */
#define IFX_PMS_EVRSTAT_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVC */
#define IFX_PMS_EVRSTAT_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVC */
#define IFX_PMS_EVRSTAT_UVC_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UV33 */
#define IFX_PMS_EVRSTAT_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UV33 */
#define IFX_PMS_EVRSTAT_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UV33 */
#define IFX_PMS_EVRSTAT_UV33_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.UVSWD */
#define IFX_PMS_EVRSTAT_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.UVSWD */
#define IFX_PMS_EVRSTAT_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.UVSWD */
#define IFX_PMS_EVRSTAT_UVSWD_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.SYNCLCK */
#define IFX_PMS_EVRSTAT_SYNCLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.SYNCLCK */
#define IFX_PMS_EVRSTAT_SYNCLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.SYNCLCK */
#define IFX_PMS_EVRSTAT_SYNCLCK_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVR33VOK */
#define IFX_PMS_EVRSTAT_EVR33VOK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVR33VOK */
#define IFX_PMS_EVRSTAT_EVR33VOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVR33VOK */
#define IFX_PMS_EVRSTAT_EVR33VOK_OFF (9u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.RSTC */
#define IFX_PMS_EVRSTAT_RSTC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.RSTC */
#define IFX_PMS_EVRSTAT_RSTC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.RSTC */
#define IFX_PMS_EVRSTAT_RSTC_OFF (13u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.RST33 */
#define IFX_PMS_EVRSTAT_RST33_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.RST33 */
#define IFX_PMS_EVRSTAT_RST33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.RST33 */
#define IFX_PMS_EVRSTAT_RST33_OFF (14u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.RSTSWD */
#define IFX_PMS_EVRSTAT_RSTSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.RSTSWD */
#define IFX_PMS_EVRSTAT_RSTSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.RSTSWD */
#define IFX_PMS_EVRSTAT_RSTSWD_OFF (15u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVRCSHLV */
#define IFX_PMS_EVRSTAT_EVRCSHLV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVRCSHLV */
#define IFX_PMS_EVRSTAT_EVRCSHLV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVRCSHLV */
#define IFX_PMS_EVRSTAT_EVRCSHLV_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVRCSHHV */
#define IFX_PMS_EVRSTAT_EVRCSHHV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVRCSHHV */
#define IFX_PMS_EVRSTAT_EVRCSHHV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVRCSHHV */
#define IFX_PMS_EVRSTAT_EVRCSHHV_OFF (17u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVR33SHLV */
#define IFX_PMS_EVRSTAT_EVR33SHLV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVR33SHLV */
#define IFX_PMS_EVRSTAT_EVR33SHLV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVR33SHLV */
#define IFX_PMS_EVRSTAT_EVR33SHLV_OFF (18u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.EVR33SHHV */
#define IFX_PMS_EVRSTAT_EVR33SHHV_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.EVR33SHHV */
#define IFX_PMS_EVRSTAT_EVR33SHHV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.EVR33SHHV */
#define IFX_PMS_EVRSTAT_EVR33SHHV_OFF (19u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.SWDLVL */
#define IFX_PMS_EVRSTAT_SWDLVL_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSTAT_Bits.SWDLVL */
#define IFX_PMS_EVRSTAT_SWDLVL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSTAT_Bits.SWDLVL */
#define IFX_PMS_EVRSTAT_SWDLVL_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSTAT_Bits.SDVOK */
#define IFX_PMS_EVRSTAT_SDVOK_LEN (1u)

