HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_EVRSDCTRL10_Bits.SHLVEN */
#define IFX_PMS_EVRSDCTRL10_SHLVEN_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL11_DROOPVH_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL11_DROOPVH_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVH */
#define IFX_PMS_EVRSDCTRL11_DROOPVH_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL11_DROOPVL_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL11_DROOPVL_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.DROOPVL */
#define IFX_PMS_EVRSDCTRL11_DROOPVL_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL11_SYNCMAXDEV_LEN (5u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL11_SYNCMAXDEV_MSK (0x1fu)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMAXDEV */
#define IFX_PMS_EVRSDCTRL11_SYNCMAXDEV_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL11_SYNCHYST_LEN (3u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL11_SYNCHYST_MSK (0x7u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.SYNCHYST */
#define IFX_PMS_EVRSDCTRL11_SYNCHYST_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL11_SYNCMUXSEL_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL11_SYNCMUXSEL_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.SYNCMUXSEL */
#define IFX_PMS_EVRSDCTRL11_SYNCMUXSEL_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL11_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL11_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCTRL11_Bits.LCK */
#define IFX_PMS_EVRSDCTRL11_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S0EN */
#define IFX_PMS_EVRSDCOEFF0_M0S0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S0EN */
#define IFX_PMS_EVRSDCOEFF0_M0S0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S0EN */
#define IFX_PMS_EVRSDCOEFF0_M0S0EN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2EN */
#define IFX_PMS_EVRSDCOEFF0_M0S2EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2EN */
#define IFX_PMS_EVRSDCOEFF0_M0S2EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2EN */
#define IFX_PMS_EVRSDCOEFF0_M0S2EN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3EN */
#define IFX_PMS_EVRSDCOEFF0_M0S3EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3EN */
#define IFX_PMS_EVRSDCOEFF0_M0S3EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3EN */
#define IFX_PMS_EVRSDCOEFF0_M0S3EN_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3CLIP */
#define IFX_PMS_EVRSDCOEFF0_M0S3CLIP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3CLIP */
#define IFX_PMS_EVRSDCOEFF0_M0S3CLIP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3CLIP */
#define IFX_PMS_EVRSDCOEFF0_M0S3CLIP_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4EN */
#define IFX_PMS_EVRSDCOEFF0_M0S4EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4EN */
#define IFX_PMS_EVRSDCOEFF0_M0S4EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4EN */
#define IFX_PMS_EVRSDCOEFF0_M0S4EN_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0RAMPEN */
#define IFX_PMS_EVRSDCOEFF0_M0RAMPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0RAMPEN */
#define IFX_PMS_EVRSDCOEFF0_M0RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0RAMPEN */
#define IFX_PMS_EVRSDCOEFF0_M0RAMPEN_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SFRGET */
#define IFX_PMS_EVRSDCOEFF0_M0SFRGET_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SFRGET */
#define IFX_PMS_EVRSDCOEFF0_M0SFRGET_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SFRGET */
#define IFX_PMS_EVRSDCOEFF0_M0SFRGET_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SKIPEN */
#define IFX_PMS_EVRSDCOEFF0_M0SKIPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SKIPEN */
#define IFX_PMS_EVRSDCOEFF0_M0SKIPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SKIPEN */
#define IFX_PMS_EVRSDCOEFF0_M0SKIPEN_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S3COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S3COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S3COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S3COEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S4COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S4COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S4COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S4COEFF_OFF (12u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0FGETCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0FGETCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF0_M0FGETCOEFF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2COEFF */
#define IFX_PMS_EVRSDCOEFF0_M0S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VINSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VINSRC_LEN (1u)

