HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VINSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VINSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0S2VOSRC */
#define IFX_PMS_EVRSDCOEFF0_M0S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFFFRAC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFFFRAC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.M0SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF0_M0SRMPCOEFFFRAC_OFF (30u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF0_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF0_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFLPF */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOCFINC */
#define IFX_PMS_EVRSDCOEFF1_M0VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF1_M0VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF1_M0VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VOUT */
#define IFX_PMS_EVRSDCOEFF1_M0VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF1_M0VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF1_M0VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0VIN */
#define IFX_PMS_EVRSDCOEFF1_M0VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S3COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S3COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S3COEFFFRAC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.M0S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S2COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.M0S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S2COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.M0S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF1_M0S2COEFFFRAC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF1_LCK_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF1_LCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF1_Bits.LCK */
#define IFX_PMS_EVRSDCOEFF1_LCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF2_M1S0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF2_M1S0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S0EN */
#define IFX_PMS_EVRSDCOEFF2_M1S0EN_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF2_M1S2EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF2_M1S2EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S2EN */
#define IFX_PMS_EVRSDCOEFF2_M1S2EN_OFF (1u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF2_M1S3EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF2_M1S3EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3EN */
#define IFX_PMS_EVRSDCOEFF2_M1S3EN_OFF (2u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF2_M1S3CLIP_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF2_M1S3CLIP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3CLIP */
#define IFX_PMS_EVRSDCOEFF2_M1S3CLIP_OFF (3u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF2_M1S4EN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF2_M1S4EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S4EN */
#define IFX_PMS_EVRSDCOEFF2_M1S4EN_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF2_M1RAMPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF2_M1RAMPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1RAMPEN */
#define IFX_PMS_EVRSDCOEFF2_M1RAMPEN_OFF (5u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF2_M1SFRGET_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF2_M1SFRGET_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1SFRGET */
#define IFX_PMS_EVRSDCOEFF2_M1SFRGET_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF2_M1SKIPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF2_M1SKIPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1SKIPEN */
#define IFX_PMS_EVRSDCOEFF2_M1SKIPEN_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S3COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S3COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF2_Bits.M1S3COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S3COEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF2_Bits.M1S4COEFF */
#define IFX_PMS_EVRSDCOEFF2_M1S4COEFF_LEN (4u)

