HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPms_bf.h
/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2SFRGET */
#define IFX_PMS_EVRSDCOEFF4_M2SFRGET_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2SFRGET */
#define IFX_PMS_EVRSDCOEFF4_M2SFRGET_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2SFRGET */
#define IFX_PMS_EVRSDCOEFF4_M2SFRGET_OFF (6u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2SKIPEN */
#define IFX_PMS_EVRSDCOEFF4_M2SKIPEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2SKIPEN */
#define IFX_PMS_EVRSDCOEFF4_M2SKIPEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2SKIPEN */
#define IFX_PMS_EVRSDCOEFF4_M2SKIPEN_OFF (7u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S3COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S3COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S3COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S3COEFF_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S4COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S4COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S4COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S4COEFF_OFF (12u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2SRMPCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2SRMPCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2SRMPCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2SRMPCOEFF_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2FGETCOEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2FGETCOEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2FGETCOEFF */
#define IFX_PMS_EVRSDCOEFF4_M2FGETCOEFF_OFF (20u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S2COEFF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S2COEFF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2COEFF */
#define IFX_PMS_EVRSDCOEFF4_M2S2COEFF_OFF (24u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VINSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VINSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VINSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VINSRC_OFF (28u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VOSRC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VOSRC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF4_Bits.M2S2VOSRC */
#define IFX_PMS_EVRSDCOEFF4_M2S2VOSRC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFLPF_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFLPF_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFLPF */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFLPF_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFINC_LEN (4u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFINC_MSK (0xfu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOCFINC */
#define IFX_PMS_EVRSDCOEFF5_M2VOCFINC_OFF (4u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF5_M2VOUT_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF5_M2VOUT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VOUT */
#define IFX_PMS_EVRSDCOEFF5_M2VOUT_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF5_M2VIN_LEN (11u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF5_M2VIN_MSK (0x7ffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2VIN */
#define IFX_PMS_EVRSDCOEFF5_M2VIN_OFF (16u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S3COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S3COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2S3COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S3COEFFFRAC_OFF (27u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S2COEFFFRAC_LEN (2u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S2COEFFFRAC_MSK (0x3u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2S2COEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2S2COEFFFRAC_OFF (29u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF5_Bits.M2SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2SRMPCOEFFFRAC_LEN (1u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF5_Bits.M2SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2SRMPCOEFFFRAC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF5_Bits.M2SRMPCOEFFFRAC */
#define IFX_PMS_EVRSDCOEFF5_M2SRMPCOEFFFRAC_OFF (31u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG0_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG0_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG0 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG0_OFF (0u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG1_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG1_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG1 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG1_OFF (8u)

/** \brief Length for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG2_LEN (8u)

/** \brief Mask for Ifx_PMS_EVRSDCOEFF6_Bits.CT5REG2 */
#define IFX_PMS_EVRSDCOEFF6_CT5REG2_MSK (0xffu)

