HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPms_bf.h
/** \brief Length for Ifx_PMS_MONBISTSTAT_Bits.PMSERR */
#define IFX_PMS_MONBISTSTAT_PMSERR_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTSTAT_Bits.PMSERR */
#define IFX_PMS_MONBISTSTAT_PMSERR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTSTAT_Bits.PMSERR */
#define IFX_PMS_MONBISTSTAT_PMSERR_OFF (5u)

/** \brief Length for Ifx_PMS_MONBISTCTRL_Bits.TSTEN */
#define IFX_PMS_MONBISTCTRL_TSTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTCTRL_Bits.TSTEN */
#define IFX_PMS_MONBISTCTRL_TSTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTCTRL_Bits.TSTEN */
#define IFX_PMS_MONBISTCTRL_TSTEN_OFF (0u)

/** \brief Length for Ifx_PMS_MONBISTCTRL_Bits.TSTCLR */
#define IFX_PMS_MONBISTCTRL_TSTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTCTRL_Bits.TSTCLR */
#define IFX_PMS_MONBISTCTRL_TSTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTCTRL_Bits.TSTCLR */
#define IFX_PMS_MONBISTCTRL_TSTCLR_OFF (1u)

/** \brief Length for Ifx_PMS_MONBISTCTRL_Bits.BITPROT */
#define IFX_PMS_MONBISTCTRL_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_MONBISTCTRL_Bits.BITPROT */
#define IFX_PMS_MONBISTCTRL_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONBISTCTRL_Bits.BITPROT */
#define IFX_PMS_MONBISTCTRL_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.SMUEN */
#define IFX_PMS_CMD_STDBY_SMUEN_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.SMUEN */
#define IFX_PMS_CMD_STDBY_SMUEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.SMUEN */
#define IFX_PMS_CMD_STDBY_SMUEN_OFF (0u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.FSP0EN */
#define IFX_PMS_CMD_STDBY_FSP0EN_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.FSP0EN */
#define IFX_PMS_CMD_STDBY_FSP0EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.FSP0EN */
#define IFX_PMS_CMD_STDBY_FSP0EN_OFF (1u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.FSP1EN */
#define IFX_PMS_CMD_STDBY_FSP1EN_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.FSP1EN */
#define IFX_PMS_CMD_STDBY_FSP1EN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.FSP1EN */
#define IFX_PMS_CMD_STDBY_FSP1EN_OFF (2u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.ASCE */
#define IFX_PMS_CMD_STDBY_ASCE_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.ASCE */
#define IFX_PMS_CMD_STDBY_ASCE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.ASCE */
#define IFX_PMS_CMD_STDBY_ASCE_OFF (3u)

/** \brief Length for Ifx_PMS_CMD_STDBY_Bits.BITPROT */
#define IFX_PMS_CMD_STDBY_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_CMD_STDBY_Bits.BITPROT */
#define IFX_PMS_CMD_STDBY_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_CMD_STDBY_Bits.BITPROT */
#define IFX_PMS_CMD_STDBY_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY0_FE4_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY0_FE4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE4 */
#define IFX_PMS_AGFSP_STDBY0_FE4_OFF (4u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY0_FE5_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY0_FE5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE5 */
#define IFX_PMS_AGFSP_STDBY0_FE5_OFF (5u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE6 */
#define IFX_PMS_AGFSP_STDBY0_FE6_OFF (6u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE7 */
#define IFX_PMS_AGFSP_STDBY0_FE7_OFF (7u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE8 */
#define IFX_PMS_AGFSP_STDBY0_FE8_OFF (8u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE9 */
#define IFX_PMS_AGFSP_STDBY0_FE9_OFF (9u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE10 */
#define IFX_PMS_AGFSP_STDBY0_FE10_OFF (10u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY0_FE11_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY0_FE11_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE11 */
#define IFX_PMS_AGFSP_STDBY0_FE11_OFF (11u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY0_FE12_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY0_FE12_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE12 */
#define IFX_PMS_AGFSP_STDBY0_FE12_OFF (12u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY0_FE13_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY0_FE13_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE13 */
#define IFX_PMS_AGFSP_STDBY0_FE13_OFF (13u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY0_FE14_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY0_FE14_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE14 */
#define IFX_PMS_AGFSP_STDBY0_FE14_OFF (14u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY0_FE15_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY0_FE15_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.FE15 */
#define IFX_PMS_AGFSP_STDBY0_FE15_OFF (15u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY0_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY0_BITPROT_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY0_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY0_BITPROT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY0_Bits.BITPROT */
#define IFX_PMS_AGFSP_STDBY0_BITPROT_OFF (30u)

/** \brief Length for Ifx_PMS_AGFSP_STDBY1_Bits.FE0 */
#define IFX_PMS_AGFSP_STDBY1_FE0_LEN (1u)

/** \brief Mask for Ifx_PMS_AGFSP_STDBY1_Bits.FE0 */
#define IFX_PMS_AGFSP_STDBY1_FE0_MSK (0x1u)

/** \brief Offset for Ifx_PMS_AGFSP_STDBY1_Bits.FE0 */
#define IFX_PMS_AGFSP_STDBY1_FE0_OFF (0u)

